1. List any five functions of the pandas library with execution.

In [10]:
import pandas as pd

In [11]:
df = pd.read_csv('taxonomy.csv')

In [12]:
df.head()

  taxonomy_id                     name parent_id     parent_name
0         101                Emergency       NaN             NaN
1      101-01        Disaster Response       101       Emergency
2      101-02           Emergency Cash       101       Emergency
3  0101-02-01        Help Pay for Food    101-02  Emergency Cash
4  0101-02-02  Help Pay for Healthcare    101-02  Emergency Cash

In [13]:
df.tail()

    taxonomy_id                          name parent_id           parent_name
285  0111-01-07              Workplace Rights    111-01  Advocacy & Legal Aid
286      111-02                     Mediation       111                 Legal
287      111-03                        Notary       111                 Legal
288      111-04                Representation       111                 Legal
289      111-05  Translation & Interpretation       111                 Legal

In [14]:
df.describe()

       taxonomy_id          name   parent_id       parent_name
count          290           290         279               279
unique         290           183          60                50
top            101  Nursing Home  0106-06-07  Health Education
freq             1             4          11                15

In [15]:
df.loc[2]

taxonomy_id            101-02
name           Emergency Cash
parent_id                 101
parent_name         Emergency
Name: 2, dtype: object

2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [18]:
df1 = pd.DataFrame({
    'A': [1, 2, 3, 4],
    'B': [5, 6, 7, 8],
    'C': [9, 10, 11, 12]
})
df1

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [22]:
def reindex(df1):
    new_index = pd.RangeIndex(1,2*len(df1),2)
    df1.index = new_index
    return df1
reindex_df1 = reindex(df1)
reindex_df1

   A  B   C
1  1  5   9
3  2  6  10
5  3  7  11
7  4  8  12

3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console. For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [23]:
dic = {'Name': ['Alice', 'Bob', 'Claire','Madiha','Fazal'],
        'Age': [25, 30, 27, 21, 21],
        'Gender': ['Female', 'Male', 'Female', 'Female', 'Male'],
      'Values': [10, 20, 30, 40, 50]}
s = pd.DataFrame(dic)
s

     Name  Age  Gender  Values
0   Alice   25  Female      10
1     Bob   30    Male      20
2  Claire   27  Female      30
3  Madiha   21  Female      40
4   Fazal   21    Male      50

In [24]:
s['Values'][0:3].sum()

60

4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [33]:
dic1 = {'Text': ['Umair Hasan Saifi','Madiha Rahman','Fazal Rehman']}
s1 = pd.DataFrame(dic1)
s1

                Text
0  Umair Hasan Saifi
1      Madiha Rahman
2       Fazal Rehman

In [34]:
s1['Word_Count'] = s1['Text'].apply(lambda x: len(x.split()))
s1

                Text  Word_Count
0  Umair Hasan Saifi           3
1      Madiha Rahman           2
2       Fazal Rehman           2

5. How are DataFrame.size() and DataFrame.shape() different?

In [35]:
#Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.
s1.size

6

In [36]:
#Returns tuple of shape (Rows, columns) of dataframe/series
s1.shape

(3, 2)

6. Which function of pandas do we use to read an excel file?

In [ ]:
df = pd.read_excel('data.xlsx')

7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address. The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [42]:
s2 = pd.DataFrame({'Email': ['madiharahman@example.com', 'fazalrehman@example.com', 'umairsaifi@example.com']})
def username(s2):
    return s2.split('@')[0]
s2['Username'] = s2['Email'].apply(username)
s2

                      Email      Username
0  madiharahman@example.com  madiharahman
1   fazalrehman@example.com   fazalrehman
2    umairsaifi@example.com    umairsaifi

8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [46]:
df3 = pd.DataFrame({'A': [3, 8, 6, 2, 9], 'B': [5, 2, 9, 3, 1], 'C': [1, 7, 4, 5, 2]})
def select_rows(df3):
    select = df3[(df3['A'] > 5) & (df3['B'] < 10)]
    return select
select = select_rows(df3)
select

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [47]:
dic = {'Name': ['Alice', 'Bob', 'Claire','Madiha','Fazal'],
        'Age': [25, 30, 27, 21, 21],
        'Gender': ['Female', 'Male', 'Female', 'Female', 'Male'],
      'Values': [10, 20, 30, 40, 50]}
s2 = pd.DataFrame(dic)

In [48]:
s2['Values'].mean()

30.0

In [49]:
s2['Values'].median()

30.0

In [50]:
s2['Values'].std()

15.811388300841896

10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [90]:
date = pd.date_range(start='2023-12-25' , end = '2023-12-31')
dic2 = {'Sales': [731.82, 243.54, 346.32, 169.68, 203.88, 4626.15, 2070.15], 'Date': date}
s3 = pd.DataFrame(dic2)
s3

     Sales       Date
0   731.82 2023-12-25
1   243.54 2023-12-26
2   346.32 2023-12-27
3   169.68 2023-12-28
4   203.88 2023-12-29
5  4626.15 2023-12-30
6  2070.15 2023-12-31

In [91]:
s3['Moving Average'] = s3['Sales'].rolling(window=7).mean()
s3

     Sales       Date  Moving Average
0   731.82 2023-12-25             NaN
1   243.54 2023-12-26             NaN
2   346.32 2023-12-27             NaN
3   169.68 2023-12-28             NaN
4   203.88 2023-12-29             NaN
5  4626.15 2023-12-30             NaN
6  2070.15 2023-12-31     1198.791429

11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [97]:
s4 = pd.DataFrame({'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']})
s4

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [98]:
def weekday(s4):
    s4['Weekday'] = pd.to_datetime(s4['Date']).dt.day_name()
    return s4
weekday = weekday(s4)
weekday

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [100]:
date = pd.date_range(start = '2023-01-01' ,end = '2023-02-20')
date

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10', '2023-01-11', '2023-01-12',
               '2023-01-13', '2023-01-14', '2023-01-15', '2023-01-16',
               '2023-01-17', '2023-01-18', '2023-01-19', '2023-01-20',
               '2023-01-21', '2023-01-22', '2023-01-23', '2023-01-24',
               '2023-01-25', '2023-01-26', '2023-01-27', '2023-01-28',
               '2023-01-29', '2023-01-30', '2023-01-31', '2023-02-01',
               '2023-02-02', '2023-02-03', '2023-02-04', '2023-02-05',
               '2023-02-06', '2023-02-07', '2023-02-08', '2023-02-09',
               '2023-02-10', '2023-02-11', '2023-02-12', '2023-02-13',
               '2023-02-14', '2023-02-15', '2023-02-16', '2023-02-17',
               '2023-02-18', '2023-02-19', '2023-02-20'],
              dtype='datetime64[ns]', freq='D')

In [101]:
s5 = pd.DataFrame({'Date': date})
s5[(s5['Date'] > '2023-01-01') &  (s5['Date'] < '2023-01-31')]

         Date
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30

13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

`import pandas`